Autodesk.Revit.DB.FamilySymbolProfile.IsFlipped
Indicates if the symbol profile is flipped or not.

Autodesk.Revit.DB.FamilySymbolProfile.Angle
The angle of the rotation of the profile in radians.

Autodesk.Revit.DB.FamilySymbolProfile.YOffset
The offset of the profile to the origin of the sketch plane in the Y direction.

Autodesk.Revit.DB.FamilySymbolProfile.XOffset
The offset of the profile to the origin of the sketch plane in the X direction.

Autodesk.Revit.DB.FamilySymbolProfile.Profile
Returns the family symbol of the profile.
Remarks: The symbol must of the category BuiltInCategory.OST_ProfileFamilies.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the category of argument is not BuiltInCategory.OST_ProfileFamilies.

Autodesk.Revit.DB.FamilySymbolProfile
Represents a family symbol based profile for sweep or swept blend elements.
Remarks: Use objects of this type in methods as NewSweep() and NewSweptBlend() in Autodesk.Revit.Creation.FamilyItemFactory
to create the profile.